data/WS-Addressing/ws-addressing-28.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</wsa:To><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s11/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:67f4646d-7e60-4aef-ba23-1ceca132cb5f</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/echoIn</Action></S:Header><S:Body><ns2:echoIn xmlns:ns2="http://example.org/echo">fault-test1145</ns2:echoIn></S:Body></S:Envelope>